TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_mlme_ext.c
	//	Operating Class
	if ( pwdinfo->invitereq_info.operating_ch <= 14 )
		p2pie[ p2pielen++ ] = 0x51;
	else if ( ( pwdinfo->invitereq_info.operating_ch >= 36 ) && ( pwdinfo->invitereq_info.operating_ch <= 48 ) )
		p2pie[ p2pielen++ ] = 0x73;
	else
		p2pie[ p2pielen++ ] = 0x7c;
	
	//	Channel Number
	p2pie[ p2pielen++ ] = pwdinfo->invitereq_info.operating_ch;	//	operating channel number

	if ( _rtw_memcmp( myid( &padapter->eeprompriv ), pwdinfo->invitereq_info.go_bssid, ETH_ALEN ) )
	{
		//	P2P Group BSSID
		//	Type:
		p2pie[ p2pielen++ ] = P2P_ATTR_GROUP_BSSID;

		//	Length:
		*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( ETH_ALEN );
		p2pielen += 2;

		//	Value:
		//	P2P Device Address for GO
		_rtw_memcpy( p2pie + p2pielen, pwdinfo->invitereq_info.go_bssid, ETH_ALEN );
		p2pielen += ETH_ALEN;
	}

	//	Channel List
	//	Type:
	p2pie[ p2pielen++ ] = P2P_ATTR_CH_LIST;

	get_channel_cnt_24g_5gl_5gh( pmlmeext, &channel_cnt_24g, &channel_cnt_5gl, &channel_cnt_5gh );
	if ( ( channel_cnt_24g ) && ( channel_cnt_5gl ) && ( channel_cnt_5gh ))
	{
		//	This Wi-Fi supports both 2.4G and 5G channels.
		//	So, there will be three Operating Class.
		//	9-> 3 ( Country String ) + 3 x ( 1 ( Operating Class ) + 1 ( Number of Channels ) )
		len_channellist_attr = 9 + channel_cnt_24g + channel_cnt_5gl + channel_cnt_5gh;
	}
	else	 if ( ( channel_cnt_24g ) && ( ( channel_cnt_5gl ) || ( channel_cnt_5gh ) ) )
	{
		//	This Wi-Fi supports both 2.4G and 5G channels.
		//	So, there will be tw Operating Class.
		//	7-> 3 ( Country String ) + 2 x ( 1 ( Operating Class ) + 1 ( Number of Channels ) )
		if ( channel_cnt_5gl )
			len_channellist_attr = 7 + channel_cnt_24g + channel_cnt_5gl;
		else
			len_channellist_attr = 7 + channel_cnt_24g + channel_cnt_5gh;		
	}
	else
	{
		//	5-> 3 ( Country String ) + 1 ( Operating Class ) + 1 ( Number of Channels )
		len_channellist_attr = 5 + channel_cnt_24g;
	}

	//	Length:
#ifdef CONFIG_CONCURRENT_MODE
	if ( check_buddy_fwstate(padapter, _FW_LINKED ) )
	{
		*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( 5 + 1 );
	}
	else
	{
		*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( len_channellist_attr );
	}
#else

	*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( len_channellist_attr );

 #endif
	p2pielen += 2;

	//	Value:
	//	Country String
	p2pie[ p2pielen++ ] = 'U';
	p2pie[ p2pielen++ ] = 'S';
	
	//	The third byte should be set to 0x04.
	//	Described in the "Operating Channel Attribute" section.
	p2pie[ p2pielen++ ] = 0x04;

	//	Channel Entry List
#ifdef CONFIG_CONCURRENT_MODE
	if ( check_buddy_fwstate(padapter, _FW_LINKED ) )
	{
		_adapter *pbuddy_adapter = padapter->pbuddy_adapter;	
		struct mlme_ext_priv	*pbuddy_mlmeext = &pbuddy_adapter->mlmeextpriv;

		//	Operating Class
		if ( pbuddy_mlmeext->cur_channel > 14 )
		{
			if ( pbuddy_mlmeext->cur_channel >= 149 )
			{
				p2pie[ p2pielen++ ] = 0x7c;
			}
			else
			{
				p2pie[ p2pielen++ ] = 0x73;
			}
		}
		else
		{
			p2pie[ p2pielen++ ] = 0x51;
		}

		//	Number of Channels
		//	Just support 1 channel and this channel is AP's channel
		p2pie[ p2pielen++ ] = 1;

		//	Channel List
		p2pie[ p2pielen++ ] = pbuddy_mlmeext->cur_channel;
	}
	else
	{
		if ( channel_cnt_24g )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x51;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_24g;	

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( pmlmeext->channel_set[ i ].ChannelNum <= 14 )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}

		if ( channel_cnt_5gl )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x73;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_5gl;

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 36 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 48 ) )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}
		
		if ( channel_cnt_5gh )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x7c;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_5gh;

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 149 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 161 ) )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}
	}
#else // CONFIG_CONCURRENT_MODE

	if ( channel_cnt_24g )
	{
		//	Operating Class
		p2pie[ p2pielen++ ] = 0x51;
		//	Number of Channels
		p2pie[ p2pielen++ ] = channel_cnt_24g;	

		//	Channel List
		for( i = 0; i < pmlmeext->max_chan_nums; i++ )
		{
			if ( pmlmeext->channel_set[ i ].ChannelNum <= 14 )
			{
				p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
			}
		}
	}

	if ( channel_cnt_5gl )
	{
		//	Operating Class
		p2pie[ p2pielen++ ] = 0x73;
		//	Number of Channels
		p2pie[ p2pielen++ ] = channel_cnt_5gl;

		//	Channel List
		for( i = 0; i < pmlmeext->max_chan_nums; i++ )
		{
			if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 36 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 48 ) )
			{
				p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
			}
		}
	}
		
	if ( channel_cnt_5gh )
	{
		//	Operating Class
		p2pie[ p2pielen++ ] = 0x7c;
		//	Number of Channels
		p2pie[ p2pielen++ ] = channel_cnt_5gh;

		//	Channel List
		for( i = 0; i < pmlmeext->max_chan_nums; i++ )
		{
			if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 149 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 161 ) )
			{
				p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
			}
		}
	}
#endif // CONFIG_CONCURRENT_MODE


	//	P2P Group ID
	//	Type:
	p2pie[ p2pielen++ ] = P2P_ATTR_GROUP_ID;

	//	Length:
	*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( 6 + pwdinfo->invitereq_info.ssidlen );
	p2pielen += 2;

	//	Value:
	//	P2P Device Address for GO
	_rtw_memcpy( p2pie + p2pielen, pwdinfo->invitereq_info.go_bssid, ETH_ALEN );
	p2pielen += ETH_ALEN;

	//	SSID
	_rtw_memcpy( p2pie + p2pielen, pwdinfo->invitereq_info.go_ssid, pwdinfo->invitereq_info.ssidlen );
	p2pielen += pwdinfo->invitereq_info.ssidlen;
	

	//	Device Info
	//	Type:
	p2pie[ p2pielen++ ] = P2P_ATTR_DEVICE_INFO;

	//	Length:
	//	21 -> P2P Device Address (6bytes) + Config Methods (2bytes) + Primary Device Type (8bytes) 
	//	+ NumofSecondDevType (1byte) + WPS Device Name ID field (2bytes) + WPS Device Name Len field (2bytes)
	*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( 21 + pwdinfo->device_name_len );
	p2pielen += 2;
	
	//	Value:
	//	P2P Device Address
	_rtw_memcpy( p2pie + p2pielen, myid( &padapter->eeprompriv ), ETH_ALEN );
	p2pielen += ETH_ALEN;

