TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_mlme_ext.c
	}

	if ( success )
	{
		//	Channel List
		//	Type:
		p2pie[ p2pielen++ ] = P2P_ATTR_CH_LIST;

		get_channel_cnt_24g_5gl_5gh( pmlmeext, &channel_cnt_24g, &channel_cnt_5gl, &channel_cnt_5gh );
		if ( ( channel_cnt_24g ) && ( channel_cnt_5gl ) && ( channel_cnt_5gh ))
		{
			//	This Wi-Fi supports both 2.4G and 5G channels.
			//	So, there will be three Operating Class.
			//	9-> 3 ( Country String ) + 3 x ( 1 ( Operating Class ) + 1 ( Number of Channels ) )
			len_channellist_attr = 9 + channel_cnt_24g + channel_cnt_5gl + channel_cnt_5gh;
		}
		else	 if ( ( channel_cnt_24g ) && ( ( channel_cnt_5gl ) || ( channel_cnt_5gh ) ) )
		{
			//	This Wi-Fi supports both 2.4G and 5G channels.
			//	So, there will be tw Operating Class.
			//	7-> 3 ( Country String ) + 2 x ( 1 ( Operating Class ) + 1 ( Number of Channels ) )
			if ( channel_cnt_5gl )
				len_channellist_attr = 7 + channel_cnt_24g + channel_cnt_5gl;
			else
				len_channellist_attr = 7 + channel_cnt_24g + channel_cnt_5gh;		
		}
		else
		{
			//	5-> 3 ( Country String ) + 1 ( Operating Class ) + 1 ( Number of Channels )
			len_channellist_attr = 5 + channel_cnt_24g;
		}

		//	Length:
#ifdef CONFIG_CONCURRENT_MODE
		if ( check_buddy_fwstate(padapter, _FW_LINKED ) )
		{
			*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( 5 + 1 );
		}
		else
		{
			*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( len_channellist_attr );
		}
#else

		*(u16*) ( p2pie + p2pielen ) = cpu_to_le16( len_channellist_attr );

#endif
		p2pielen += 2;

		//	Value:
		//	Country String
		p2pie[ p2pielen++ ] = 'U';
		p2pie[ p2pielen++ ] = 'S';
	
		//	The third byte should be set to 0x04.
		//	Described in the "Operating Channel Attribute" section.
		p2pie[ p2pielen++ ] = 0x04;

		//	Channel Entry List
#ifdef CONFIG_CONCURRENT_MODE
		if ( check_buddy_fwstate(padapter, _FW_LINKED ) )
		{
			_adapter *pbuddy_adapter = padapter->pbuddy_adapter;	
			struct mlme_ext_priv	*pbuddy_mlmeext = &pbuddy_adapter->mlmeextpriv;

			//	Operating Class
			if ( pbuddy_mlmeext->cur_channel > 14 )
			{
				if ( pbuddy_mlmeext->cur_channel >= 149 )
				{
					p2pie[ p2pielen++ ] = 0x7c;
				}
				else
				{
					p2pie[ p2pielen++ ] = 0x73;
				}
			}
			else
			{
				p2pie[ p2pielen++ ] = 0x51;
			}

			//	Number of Channels
			//	Just support 1 channel and this channel is AP's channel
			p2pie[ p2pielen++ ] = 1;

			//	Channel List
			p2pie[ p2pielen++ ] = pbuddy_mlmeext->cur_channel;
		}
		else
		{
			if ( channel_cnt_24g )
			{
				//	Operating Class
				p2pie[ p2pielen++ ] = 0x51;
				//	Number of Channels
				p2pie[ p2pielen++ ] = channel_cnt_24g;	

				//	Channel List
				for( i = 0; i < pmlmeext->max_chan_nums; i++ )
				{
					if ( pmlmeext->channel_set[ i ].ChannelNum <= 14 )
					{
						p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
					}
				}
			}

			if ( channel_cnt_5gl )
			{
				//	Operating Class
				p2pie[ p2pielen++ ] = 0x73;
				//	Number of Channels
				p2pie[ p2pielen++ ] = channel_cnt_5gl;

				//	Channel List
				for( i = 0; i < pmlmeext->max_chan_nums; i++ )
				{
					if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 36 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 48 ) )
					{
						p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
					}
				}
			}
			
			if ( channel_cnt_5gh )
			{
				//	Operating Class
				p2pie[ p2pielen++ ] = 0x7c;
				//	Number of Channels
				p2pie[ p2pielen++ ] = channel_cnt_5gh;

				//	Channel List
				for( i = 0; i < pmlmeext->max_chan_nums; i++ )
				{
					if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 149 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 161 ) )
					{
						p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
					}
				}
			}
		}
#else // CONFIG_CONCURRENT_MODE

		if ( channel_cnt_24g )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x51;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_24g;	

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( pmlmeext->channel_set[ i ].ChannelNum <= 14 )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}

		if ( channel_cnt_5gl )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x73;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_5gl;

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 36 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 48 ) )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}
			
		if ( channel_cnt_5gh )
		{
			//	Operating Class
			p2pie[ p2pielen++ ] = 0x7c;
			//	Number of Channels
			p2pie[ p2pielen++ ] = channel_cnt_5gh;

			//	Channel List
			for( i = 0; i < pmlmeext->max_chan_nums; i++ )
			{
				if ( ( pmlmeext->channel_set[ i ].ChannelNum >= 149 ) && ( pmlmeext->channel_set[ i ].ChannelNum <= 161 ) )
				{
					p2pie[ p2pielen++ ] = pmlmeext->channel_set[ i ].ChannelNum;
				}
			}
		}
#endif // CONFIG_CONCURRENT_MODE
	}
		
	pframe = rtw_set_ie(pframe, _VENDOR_SPECIFIC_IE_, p2pielen, (unsigned char *) p2pie, &pattrib->pktlen );	
	
#ifdef CONFIG_WFD
	wfdielen = build_invitation_resp_wfd_ie(pwdinfo, pframe);
	pframe += wfdielen;
	pattrib->pktlen += wfdielen;
#endif //CONFIG_WFD

	pattrib->last_txcmdsz = pattrib->pktlen;

	dump_mgntframe(padapter, pmgntframe);

	return;

}

void issue_p2p_provision_request(_adapter *padapter, u8* pssid, u8 ussidlen, u8* pdev_raddr )
{
	unsigned char category = RTW_WLAN_CATEGORY_PUBLIC;
	u8			action = P2P_PUB_ACTION_ACTION;
	u8			dialogToken = 1;
	u32			p2poui = cpu_to_be32(P2POUI);
	u8			oui_subtype = P2P_PROVISION_DISC_REQ;
	u8			wpsie[ 100 ] = { 0x00 };
	u8			wpsielen = 0;
	u32			p2pielen = 0;
#ifdef CONFIG_WFD
	u32					wfdielen = 0;
#endif //CONFIG_WFD		
	
	struct xmit_frame			*pmgntframe;
	struct pkt_attrib			*pattrib;
	unsigned char					*pframe;
	struct rtw_ieee80211_hdr	*pwlanhdr;
	unsigned short				*fctrl;
	struct xmit_priv			*pxmitpriv = &(padapter->xmitpriv);
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct wifidirect_info	*pwdinfo = &(padapter->wdinfo);


	if ((pmgntframe = alloc_mgtxmitframe(pxmitpriv)) == NULL)
	{
		return;
	}

