TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_mlme_ext.c
						//	Commented by Kurt 20110902
						//Add if statement to avoid receiving duplicate prov disc req. such that pre_p2p_state would be covered.
						if(!rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_ING))
							rtw_p2p_set_pre_state(pwdinfo, rtw_p2p_state(pwdinfo));

						//	Commented by Kurt 20120113
						//	Get peer_dev_addr here if peer doesn't issue prov_disc frame.
						if( _rtw_memcmp(pwdinfo->rx_prov_disc_info.peerDevAddr, empty_addr, ETH_ALEN) );
							_rtw_memcpy(pwdinfo->rx_prov_disc_info.peerDevAddr, GetAddr2Ptr(pframe), ETH_ALEN);

						result = process_p2p_group_negotation_req( pwdinfo, frame_body, len );
						issue_p2p_GO_response( padapter, GetAddr2Ptr(pframe), frame_body, len, result );
						//	Commented by Albert 20110718
						//	No matter negotiating or negotiation failure, the driver should set up the restore P2P state timer.
#ifdef CONFIG_CONCURRENT_MODE
						//	Commented by Albert 20120107
						_set_timer( &pwdinfo->restore_p2p_state_timer, 1000 );
#else // CONFIG_CONCURRENT_MODE
						_set_timer( &pwdinfo->restore_p2p_state_timer, 5000 );
#endif // CONFIG_CONCURRENT_MODE
						break;					
					}
					case P2P_GO_NEGO_RESP:
					{
						DBG_871X( "[%s] Got GO Nego Resp Frame\n", __FUNCTION__);
	
						if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_ING))
						{
							//	Commented by Albert 20110425
							//	The restore timer is enabled when issuing the nego request frame of rtw_p2p_connect function.
							_cancel_timer_ex( &pwdinfo->restore_p2p_state_timer );
							pwdinfo->nego_req_info.benable = _FALSE;
							result = process_p2p_group_negotation_resp( pwdinfo, frame_body, len);
	
							issue_p2p_GO_confirm( pwdinfo->padapter, GetAddr2Ptr(pframe), result);

							//	Reset the dialog token for group negotiation frames.
							pwdinfo->negotiation_dialog_token = 1;

							if(rtw_p2p_chk_state(pwdinfo, P2P_STATE_GONEGO_FAIL))
							{
								_set_timer( &pwdinfo->restore_p2p_state_timer, 5000 );
							}
						}
						else
						{
							DBG_871X( "[%s] Skipped GO Nego Resp Frame (p2p_state != P2P_STATE_GONEGO_ING)\n", __FUNCTION__);
						}
						
						break;
					}
					case P2P_GO_NEGO_CONF:
					{
						DBG_871X( "[%s] Got GO Nego Confirm Frame\n", __FUNCTION__);
						process_p2p_group_negotation_confirm( pwdinfo, frame_body, len);
						break;
					}
					case P2P_INVIT_REQ:
					{
						//	Added by Albert 2010/10/05
						//	Received the P2P Invite Request frame.
						
						DBG_871X( "[%s] Got invite request frame!\n", __FUNCTION__ );
						if ( (p2p_ie=rtw_get_p2p_ie( frame_body + _PUBLIC_ACTION_IE_OFFSET_, len - _PUBLIC_ACTION_IE_OFFSET_, NULL, &p2p_ielen)) )
						{
							//	Parse the necessary information from the P2P Invitation Request frame.
							//	For example: The MAC address of sending this P2P Invitation Request frame.
							u32	attr_contentlen = 0;
							u8	match_result = 0;
							struct group_id_info group_id;
							u8	invitation_flag = 0;

							rtw_get_p2p_attr_content( p2p_ie, p2p_ielen, P2P_ATTR_INVITATION_FLAGS, &invitation_flag, &attr_contentlen);
							if ( attr_contentlen )
							{

								rtw_get_p2p_attr_content( p2p_ie, p2p_ielen, P2P_ATTR_GROUP_BSSID, pwdinfo->p2p_peer_interface_addr, &attr_contentlen);
								//	Commented by Albert 20120510
								//	Copy to the pwdinfo->p2p_peer_interface_addr.
								//	So that the WFD UI ( or Sigma ) can get the peer interface address by using the following command.
								//	#> iwpriv wlan0 p2p_get peer_ifa
								//	After having the peer interface address, the sigma can find the correct conf file for wpa_supplicant.

								if ( attr_contentlen )
								{
									DBG_871X( "[%s] GO's BSSID = %.2X %.2X %.2X %.2X %.2X %.2X\n", __FUNCTION__,
											pwdinfo->p2p_peer_interface_addr[0], pwdinfo->p2p_peer_interface_addr[1],
											pwdinfo->p2p_peer_interface_addr[2], pwdinfo->p2p_peer_interface_addr[3],
											pwdinfo->p2p_peer_interface_addr[4], pwdinfo->p2p_peer_interface_addr[5] );
								}								

								if ( invitation_flag & P2P_INVITATION_FLAGS_PERSISTENT )
								{
									//	Re-invoke the persistent group.
									
									_rtw_memset( &group_id, 0x00, sizeof( struct group_id_info ) );
									rtw_get_p2p_attr_content( p2p_ie, p2p_ielen, P2P_ATTR_GROUP_ID, ( u8* ) &group_id, &attr_contentlen);
									if ( attr_contentlen )
									{
										if ( _rtw_memcmp( group_id.go_device_addr, myid( &padapter->eeprompriv ), ETH_ALEN ) )
										{
											//	The p2p device sending this p2p invitation request wants this Wi-Fi device to be the persistent GO.
											rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ_GO );
											rtw_p2p_set_role( pwdinfo, P2P_ROLE_GO );
											match_result = 2;
										}
										else
										{
											//	The p2p device sending this p2p invitation request wants to be the persistent GO.
											if ( is_matched_in_profilelist( pwdinfo->p2p_peer_interface_addr, &pwdinfo->profileinfo[ 0 ] ) )
											{
												rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ_MATCH );
												rtw_p2p_set_role( pwdinfo, P2P_ROLE_CLIENT );
												match_result = 1;
											}
											else
											{
												rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ_DISMATCH );
												match_result = 0;
											}
										}
									}
									else
									{
										DBG_871X( "[%s] P2P Group ID Attribute NOT FOUND!\n", __FUNCTION__ );
										match_result = 0;
									}									
								}
								else
								{
									//	Received the invitation to join a P2P group.

									_rtw_memset( &group_id, 0x00, sizeof( struct group_id_info ) );
									rtw_get_p2p_attr_content( p2p_ie, p2p_ielen, P2P_ATTR_GROUP_ID, ( u8* ) &group_id, &attr_contentlen);
									if ( attr_contentlen )
									{
										if ( _rtw_memcmp( group_id.go_device_addr, myid( &padapter->eeprompriv ), ETH_ALEN ) )
										{
											//	In this case, the GO can't be myself.
											rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ_DISMATCH );
											match_result = 0;
										}
										else
										{
											//	The p2p device sending this p2p invitation request wants to join an existing P2P group
											//	Commented by Albert 2012/06/28
											//	In this case, this Wi-Fi device should use the iwpriv command to get the peer device address.
											//	The peer device address should be the destination address for the provisioning discovery request.
											//	Then, this Wi-Fi device should use the iwpriv command to get the peer interface address.
											//	The peer interface address should be the address for WPS mac address
											_rtw_memcpy( pwdinfo->p2p_peer_device_addr, group_id.go_device_addr , ETH_ALEN );											
											rtw_p2p_set_role( pwdinfo, P2P_ROLE_CLIENT );
											rtw_p2p_set_state(pwdinfo, P2P_STATE_RECV_INVITE_REQ_JOIN );
											match_result = 1;
										}
									}
									else
									{
										DBG_871X( "[%s] P2P Group ID Attribute NOT FOUND!\n", __FUNCTION__ );
										match_result = 0;
									}
								}
							}
							else
							{
								DBG_871X( "[%s] P2P Invitation Flags Attribute NOT FOUND!\n", __FUNCTION__ );
								match_result = 0;
							}							

							DBG_871X( "[%s] match_result = %d\n", __FUNCTION__, match_result );
						
							pwdinfo->inviteresp_info.token = frame_body[ 7 ];
							issue_p2p_invitation_response( padapter, GetAddr2Ptr(pframe), pwdinfo->inviteresp_info.token, match_result );
						}

						break;
					}
					case P2P_INVIT_RESP:
					{
						u8	attr_content = 0x00;
						u32	attr_contentlen = 0;
						
						DBG_871X( "[%s] Got invite response frame!\n", __FUNCTION__ );
						_cancel_timer_ex( &pwdinfo->restore_p2p_state_timer );
						if ( (p2p_ie=rtw_get_p2p_ie( frame_body + _PUBLIC_ACTION_IE_OFFSET_, len - _PUBLIC_ACTION_IE_OFFSET_, NULL, &p2p_ielen)) )
						{
							rtw_get_p2p_attr_content(p2p_ie, p2p_ielen, P2P_ATTR_STATUS, &attr_content, &attr_contentlen);
											
							if ( attr_contentlen == 1 )
							{
								DBG_871X( "[%s] Status = %d\n", __FUNCTION__, attr_content );
								pwdinfo->invitereq_info.benable = _FALSE;

