TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_mlme_ext.c
}

void mlmeext_sta_add_event_callback(_adapter *padapter, struct sta_info *psta)
{
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	u8	join_type;

	DBG_871X("%s\n", __FUNCTION__);

	if((pmlmeinfo->state&0x03) == WIFI_FW_ADHOC_STATE)
	{
		if(pmlmeinfo->state & WIFI_FW_ASSOC_SUCCESS)//adhoc master or sta_count>1
		{
			//nothing to do
		}
		else//adhoc client
		{
			//update TSF Value
			//update_TSF(pmlmeext, pframe, len);			

			// correcting TSF
			correct_TSF(padapter, pmlmeext);

			//start beacon
			if(send_beacon(padapter)==_FAIL)
			{
				pmlmeinfo->FW_sta_info[psta->mac_id].status = 0;

				pmlmeinfo->state ^= WIFI_FW_ADHOC_STATE;

				return;
			}

			pmlmeinfo->state |= WIFI_FW_ASSOC_SUCCESS;
				
		}

		join_type = 2;
		rtw_hal_set_hwreg(padapter, HW_VAR_MLME_JOIN, (u8 *)(&join_type));
	}

	pmlmeinfo->FW_sta_info[psta->mac_id].psta = psta;

	//rate radaptive
	Update_RA_Entry(padapter, psta->mac_id);

	//update adhoc sta_info
	update_sta_info(padapter, psta);

}

void mlmeext_sta_del_event_callback(_adapter *padapter)
{
	struct mlme_ext_priv	*pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);

	if (is_client_associated_to_ap(padapter) || is_IBSS_empty(padapter))
	{
		//set_opmode_cmd(padapter, infra_client_with_mlme);

		rtw_hal_set_hwreg(padapter, HW_VAR_MLME_DISCONNECT, 0);
		rtw_hal_set_hwreg(padapter, HW_VAR_BSSID, null_addr);

#ifdef CONFIG_DUALMAC_CONCURRENT
		dc_set_channel_bwmode_disconnect(padapter);
#else
#ifdef CONFIG_CONCURRENT_MODE	
		if((check_buddy_fwstate(padapter, _FW_LINKED)) != _TRUE)
		{
#endif //CONFIG_CONCURRENT_MODE

		//switch to the 20M Hz mode after disconnect
		pmlmeext->cur_bwmode = HT_CHANNEL_WIDTH_20;
		pmlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;

		//SelectChannel(padapter, pmlmeext->cur_channel, pmlmeext->cur_ch_offset);
		set_channel_bwmode(padapter, pmlmeext->cur_channel, pmlmeext->cur_ch_offset, pmlmeext->cur_bwmode);
	
#ifdef CONFIG_CONCURRENT_MODE				
		}
#endif //CONFIG_CONCURRENT_MODE
#endif //CONFIG_DUALMAC_CONCURRENT

		flush_all_cam_entry(padapter);

		pmlmeinfo->state = WIFI_FW_NULL_STATE;

		//set MSR to no link state -> infra. mode
		Set_MSR(padapter, _HW_STATE_STATION_);

		_cancel_timer_ex(&pmlmeext->link_timer);

	}

}

/****************************************************************************

Following are the functions for the timer handlers

*****************************************************************************/
void _linked_rx_signal_strehgth_display(_adapter *padapter);
void _linked_rx_signal_strehgth_display(_adapter *padapter)
{
	struct mlme_ext_priv    *pmlmeext = &padapter->mlmeextpriv;
        struct mlme_ext_info    *pmlmeinfo = &(pmlmeext->mlmext_info);
	u8 mac_id;
	#if 0
	DBG_871X("============ linked status check ===================\n");
	DBG_871X("pathA Rx SNRdb:%d\n",padapter->recvpriv.RxSNRdB[0]);
	DBG_871X("pathA Rx PWDB:%d\n",padapter->recvpriv.rxpwdb);		
	rtw_hal_get_def_var(padapter, HAL_DEF_UNDERCORATEDSMOOTHEDPWDB, &UndecoratedSmoothedPWDB);
	DBG_871X("UndecoratedSmoothedPWDB:%d\n",UndecoratedSmoothedPWDB);
	DBG_871X("Rx RSSI:%d\n",padapter->recvpriv.rssi);
	DBG_871X("Rx Signal_strength:%d\n",padapter->recvpriv.signal_strength);
	DBG_871X("Rx Signal_qual:%d \n",padapter->recvpriv.signal_qual);
	DBG_871X("============ linked status check ===================\n");
	#endif
	if((pmlmeinfo->state&0x03) == WIFI_FW_STATION_STATE)
	{
		mac_id=0;
	}
	else if((pmlmeinfo->state&0x03) == _HW_STATE_AP_)
	{
		mac_id=2;		
	}
	
	rtw_hal_get_def_var(padapter, HW_DEF_RA_INFO_DUMP,&mac_id);	
	
	DBG_871X("============ RX GAIN / FALSE ALARM  ===================\n");
	DBG_871X(" DIG PATH-A(0x%02x), PATH-B(0x%02x)\n",rtw_read8(padapter,0xc50),rtw_read8(padapter,0xc58));
	DBG_871X(" OFDM -Alarm DA2(0x%04x),DA4(0x%04x),DA6(0x%04x),DA8(0x%04x)\n",
		rtw_read16(padapter,0xDA2),rtw_read16(padapter,0xDA4),rtw_read16(padapter,0xDA6),rtw_read16(padapter,0xDA8));

	DBG_871X(" CCK -Alarm A5B(0x%02x),A5C(0x%02x)\n",rtw_read8(padapter,0xA5B),rtw_read8(padapter,0xA5C));
	

}

void linked_status_chk(_adapter *padapter)
{
	u32	i;
	struct sta_info		*psta;
	struct xmit_priv		*pxmitpriv = &(padapter->xmitpriv);
	struct mlme_ext_priv	*pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct sta_priv		*pstapriv = &padapter->stapriv;

	//
	if(padapter->bRxRSSIDisplay)
		 _linked_rx_signal_strehgth_display(padapter);

	if (is_client_associated_to_ap(padapter))
	{
		//linked infrastructure client mode
		if ((psta = rtw_get_stainfo(pstapriv, pmlmeinfo->network.MacAddress)) != NULL)
		{
			#ifdef DBG_EXPIRATION_CHK
			DBG_871X("%s rx:"STA_PKTS_FMT", BI:%u, retry:%u\n"
				, __FUNCTION__
				, STA_RX_PKTS_ARG(psta)
				, pmlmeinfo->bcn_interval
				, pmlmeext->retry
			);
			#endif

			/*to monitor whether the AP is alive or not*/
			if (sta_last_rx_pkts(psta) == sta_rx_pkts(psta))
			{
				//	Commented by Albert 2010/07/21
				//	In this case, there is no any rx packet received by driver.

				#if defined(DBG_ROAMING_TEST) || defined(CONFIG_INTEL_WIDI)
				if(pmlmeext->retry<1)
				#else
				if(pmlmeext->retry<8)// Alter the retry limit to 8
				#endif
				{
					if(pmlmeext->retry==0)
					{
						#ifdef DBG_CONFIG_ERROR_DETECT	
						rtw_hal_sreset_linked_status_check(padapter);						
						#endif

						//	In order to know the AP's current state, try to send the probe request 
						//	to trigger the AP to send the probe response.
						#ifdef CONFIG_P2P
						if(!rtw_p2p_chk_state(&padapter->wdinfo, P2P_STATE_NONE)) {
							#ifdef DBG_EXPIRATION_CHK
							DBG_871X("issue_probereq_p2p to trigger probersp, retry=%d\n", pmlmeext->retry);
							#endif
							issue_probereq_p2p(padapter);
						} else
						#endif
						{
							#ifdef DBG_EXPIRATION_CHK
							DBG_871X("issue_probereq to trigger probersp, retry=%d\n", pmlmeext->retry);
							#endif
							issue_probereq(padapter, &(pmlmeinfo->network.Ssid), 0);
							issue_probereq(padapter, &(pmlmeinfo->network.Ssid), 0);
							issue_probereq(padapter, &(pmlmeinfo->network.Ssid), 0);
						}
					}
					
					pmlmeext->retry++;
				}
				else
				{
					pmlmeext->retry = 0;
                                	DBG_871X("no beacon to call receive_disconnect()\n");
					receive_disconnect(padapter, pmlmeinfo->network.MacAddress
						, 65535// indicate disconnect caused by no rx
					);
					pmlmeinfo->link_count = 0;
					return;
				}
			}
			else
			{
				pmlmeext->retry = 0;
				sta_update_last_rx_pkts(psta);
				//set_link_timer(pmlmeext, DISCONNECT_TO);
			}

			#ifdef DBG_EXPIRATION_CHK
			DBG_871X("%s tx_pkts:%llu, link_count:%u\n", __FUNCTION__
				, pxmitpriv->tx_pkts
				, pmlmeinfo->link_count
			);
			#endif

			/*to send the AP a nulldata if no frame is xmitted in order to keep alive*/
			if(pxmitpriv->last_tx_pkts == pxmitpriv->tx_pkts)
			{
				if(pmlmeinfo->link_count++ == 0xf)
				{
					//DBG_871X("(Interface %d)issue nulldata to keep alive\n",padapter->dvobjpriv.InterfaceNumber);
					#ifdef DBG_EXPIRATION_CHK
					DBG_871X("%s issue_nulldata 0\n", __FUNCTION__);
					#endif
					issue_nulldata(padapter, 0);
					pmlmeinfo->link_count = 0;
				}
			}
			else
			{
				pxmitpriv->last_tx_pkts = pxmitpriv->tx_pkts;
				pmlmeinfo->link_count = 0;
			}

		} //end of if ((psta = rtw_get_stainfo(pstapriv, passoc_res->network.MacAddress)) != NULL)
	}
	else if (is_client_associated_to_ibss(padapter))
	{
		//linked IBSS mode
		//for each assoc list entry to check the rx pkt counter
		for (i = IBSS_START_MAC_ID; i < NUM_STA; i++)
		{
			if (pmlmeinfo->FW_sta_info[i].status == 1)
			{
				psta = pmlmeinfo->FW_sta_info[i].psta;

				if(NULL==psta) continue;

				if (pmlmeinfo->FW_sta_info[i].rx_pkt == sta_rx_pkts(psta))
				{

					if(pmlmeinfo->FW_sta_info[i].retry<3)
					{
						pmlmeinfo->FW_sta_info[i].retry++;
					}
					else
					{
						pmlmeinfo->FW_sta_info[i].retry = 0;
						pmlmeinfo->FW_sta_info[i].status = 0;
						report_del_sta_event(padapter, psta->hwaddr
							, 65535// indicate disconnect caused by no rx
						);
					}	
				}
				else
				{
					pmlmeinfo->FW_sta_info[i].retry = 0;
					pmlmeinfo->FW_sta_info[i].rx_pkt = (u32)sta_rx_pkts(psta);
				}
			}
		}

		//set_link_timer(pmlmeext, DISCONNECT_TO);

