TsunghsienWu/wm8850/ANDROID_3.0.8/drivers/net/wireless/rtl8723vau/rtl8723A_WiFi_linux_v4.1.1_4756.20120731/core/rtw_mlme_ext.c
	DBG_871X("dualmac_concurrent_ap_set_channel_bwmode <==\n");
}

void dc_resume_xmit(_adapter *padapter)
{
	PADAPTER pbuddy_adapter = padapter->pbuddy_adapter;
	
	if(pbuddy_adapter != NULL && 
		padapter->DualMacConcurrent == _TRUE)
	{
		DBG_871X("dc_resume_xmit,  resume pbuddy_adapter Tx\n");
		rtw_os_xmit_schedule(pbuddy_adapter);
	}
}

u8	dc_check_xmit(_adapter *padapter)
{
	PADAPTER pbuddy_adapter = padapter->pbuddy_adapter;
	struct mlme_priv *pbuddy_mlmepriv = NULL;

	if(pbuddy_adapter != NULL && 
		padapter->DualMacConcurrent == _TRUE)
	{
		pbuddy_mlmepriv = &(pbuddy_adapter->mlmepriv);
		if (check_fwstate(pbuddy_mlmepriv, _FW_UNDER_SURVEY|_FW_UNDER_LINKING) == _TRUE)
		{
			DBG_871X("dc_check_xmit  pbuddy_adapter is under survey or under linking\n");
			return _FALSE;
		}
	}

	return _TRUE;
}
#endif

#ifdef CONFIG_CONCURRENT_MODE
sint check_buddy_mlmeinfo_state(_adapter *padapter, u32 state)
{
	PADAPTER pbuddy_adapter;
	struct mlme_ext_priv *pbuddy_mlmeext;
	struct mlme_ext_info *pbuddy_mlmeinfo;

	if(padapter == NULL)
		return _FALSE;	
	
	pbuddy_adapter = padapter->pbuddy_adapter;

	if(pbuddy_adapter == NULL)
		return _FALSE;	


	pbuddy_mlmeext = &pbuddy_adapter->mlmeextpriv;
	pbuddy_mlmeinfo = &(pbuddy_mlmeext->mlmext_info);
		
	if((pbuddy_mlmeinfo->state&0x03) == state)
		return _TRUE;		

	return _FALSE;
	
}

int concurrent_chk_start_clnt_join(_adapter *padapter)
{
	int ret = _FAIL;
	struct mlme_ext_priv	*pmlmeext;
	struct mlme_ext_info	*pmlmeinfo;
	PADAPTER pbuddy_adapter;	
	struct mlme_ext_priv *pbuddy_mlmeext;
	struct mlme_ext_info	*pbuddy_pmlmeinfo;
	struct mlme_priv *pbuddy_mlmepriv;

	if(!rtw_buddy_adapter_up(padapter))
		return _SUCCESS;

	pmlmeext = &padapter->mlmeextpriv;
	pmlmeinfo = &(pmlmeext->mlmext_info);	

	pbuddy_adapter = padapter->pbuddy_adapter;		
	pbuddy_mlmeext = &pbuddy_adapter->mlmeextpriv;
	pbuddy_pmlmeinfo = &(pbuddy_mlmeext->mlmext_info);
	pbuddy_mlmepriv = &(pbuddy_adapter->mlmepriv);

	//for AP MODE
	if(((pbuddy_pmlmeinfo->state&0x03) == WIFI_FW_AP_STATE) &&
		(pmlmeext->cur_channel != pbuddy_mlmeext->cur_channel ||
		pmlmeext->cur_bwmode != pbuddy_mlmeext->cur_bwmode ||
		pmlmeext->cur_ch_offset != pbuddy_mlmeext->cur_ch_offset))
	{
		//issue deauth to all stas if if2 is at ap mode
		rtw_sta_flush(pbuddy_adapter);			

		rtw_hal_set_hwreg(padapter, HW_VAR_CHECK_TXBUF, 0);	
	}
	else if(check_fwstate(pbuddy_mlmepriv, _FW_LINKED) == _TRUE &&
		check_fwstate(pbuddy_mlmepriv, WIFI_STATION_STATE) == _TRUE) //for Client Mode
	{
		if(pmlmeext->cur_channel != pbuddy_mlmeext->cur_channel)
		{
			DBG_871X("start_clnt_join(ch=%d), but channel mismatch with buddy(ch=%d) interface\n", 
				pmlmeext->cur_channel, pbuddy_mlmeext->cur_channel);
				
			report_join_res(padapter, (-4));

			return ret;
		}

		if((pmlmeext->cur_bwmode == HT_CHANNEL_WIDTH_40) &&
			(pbuddy_mlmeext->cur_bwmode == HT_CHANNEL_WIDTH_40) && 
			(pmlmeext->cur_ch_offset != pbuddy_mlmeext->cur_ch_offset))
		{
			DBG_871X("start_clnt_join(bwmode=%d, ch_offset=%d), but bwmode & ch_offset mismatch with buddy(bwmode=%d, ch_offset=%d) interface\n", 
				pmlmeext->cur_bwmode, pmlmeext->cur_ch_offset, pbuddy_mlmeext->cur_bwmode, pbuddy_mlmeext->cur_ch_offset);
			
			report_join_res(padapter, (-4));

			return ret;
		}			

	}	
	
	return _SUCCESS;
	
}

void concurrent_chk_joinbss_done(_adapter *padapter, int join_res)
{
	struct mlme_ext_priv	*pmlmeext;
	struct mlme_ext_info	*pmlmeinfo;	
	PADAPTER pbuddy_adapter;
	struct mlme_priv *pbuddy_mlmepriv;
	struct mlme_ext_priv *pbuddy_mlmeext;
	struct mlme_ext_info *pbuddy_mlmeinfo;
	WLAN_BSSID_EX *pbuddy_network_mlmeext;

	if(!rtw_buddy_adapter_up(padapter))
		return;

	pmlmeext = &padapter->mlmeextpriv;
	pmlmeinfo = &(pmlmeext->mlmext_info);	
	
	pbuddy_adapter = padapter->pbuddy_adapter;
	pbuddy_mlmepriv = &(pbuddy_adapter->mlmepriv);
	pbuddy_mlmeext = &pbuddy_adapter->mlmeextpriv;
	pbuddy_mlmeinfo = &(pbuddy_mlmeext->mlmext_info);
	pbuddy_network_mlmeext = &(pbuddy_mlmeinfo->network);

	if(((pbuddy_mlmeinfo->state&0x03) == WIFI_FW_AP_STATE) &&
			check_fwstate(pbuddy_mlmepriv, _FW_LINKED))
	{
		//restart and update beacon

		DBG_871X("after join,primary adapter, CH=%d, BW=%d, offset=%d\n"
		, pmlmeext->cur_channel, pmlmeext->cur_bwmode, pmlmeext->cur_ch_offset);
		

		if(join_res >= 0)
		{
			u8 *p;
			int	ie_len;
			struct HT_info_element *pht_info=NULL;
			
			//sync channel/bwmode/ch_offset with primary adapter
			pbuddy_mlmeext->cur_channel = pmlmeext->cur_channel;
			if(pbuddy_mlmeext->cur_bwmode == HT_CHANNEL_WIDTH_40)
			{
				p = rtw_get_ie((pbuddy_network_mlmeext->IEs + sizeof(NDIS_802_11_FIXED_IEs)), _HT_ADD_INFO_IE_, &ie_len, (pbuddy_network_mlmeext->IELength - sizeof(NDIS_802_11_FIXED_IEs)));
				if( p && ie_len)
				{
					pht_info = (struct HT_info_element *)(p+2);
					pht_info->infos[0] &= ~(BIT(0)|BIT(1)); //no secondary channel is present
				}	
			
				if(pmlmeext->cur_bwmode == HT_CHANNEL_WIDTH_40)
				{
					pbuddy_mlmeext->cur_ch_offset = pmlmeext->cur_ch_offset;

					//to update cur_ch_offset value in beacon
					if( pht_info )
					{
						switch(pmlmeext->cur_ch_offset)
						{
							case HAL_PRIME_CHNL_OFFSET_LOWER:
								pht_info->infos[0] |= 0x1;
								break;
							case HAL_PRIME_CHNL_OFFSET_UPPER:
								pht_info->infos[0] |= 0x3;
								break;
							case HAL_PRIME_CHNL_OFFSET_DONT_CARE:							
							default:							
								break;					
						}
						
					}					
				
				}
				else if(pmlmeext->cur_bwmode == HT_CHANNEL_WIDTH_20)
				{
					if(pmlmeext->cur_channel>=1 && pmlmeext->cur_channel<=4)
					{
						if(pht_info)
							pht_info->infos[0] |= HT_INFO_HT_PARAM_SECONDARY_CHNL_ABOVE;		

						pbuddy_mlmeext->cur_bwmode = HT_CHANNEL_WIDTH_40;
						pbuddy_mlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_LOWER;
					}
					else if(pmlmeext->cur_channel>=5 && pmlmeext->cur_channel<=14)
					{
						if(pht_info)
							pht_info->infos[0] |= HT_INFO_HT_PARAM_SECONDARY_CHNL_BELOW;
						
						pbuddy_mlmeext->cur_bwmode = HT_CHANNEL_WIDTH_40;
						pbuddy_mlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_UPPER;						
					}
					else
					{
						switch(pmlmeext->cur_channel)
						{
							case 36:
							case 44:
							case 52:
							case 60:
							case 100:
							case 108:
							case 116:
							case 124:
							case 132:
							case 149:
							case 157:
							{
								if(pht_info)
									pht_info->infos[0] |= HT_INFO_HT_PARAM_SECONDARY_CHNL_ABOVE;		
								pbuddy_mlmeext->cur_bwmode = HT_CHANNEL_WIDTH_40;
								pbuddy_mlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_LOWER;
								break;
							}
							case 40:
							case 48:
							case 56:
							case 64:
							case 104:
							case 112:
							case 120:
							case 128:
							case 136:
							case 153:
							case 161:
							{
								if(pht_info)
									pht_info->infos[0] |= HT_INFO_HT_PARAM_SECONDARY_CHNL_BELOW;
								
								pbuddy_mlmeext->cur_bwmode = HT_CHANNEL_WIDTH_40;
								pbuddy_mlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_UPPER;
								break;
							}
							default:
								if(pht_info)
									pht_info->infos[0] &= ~HT_INFO_HT_PARAM_SECONDARY_CHNL_BELOW;
								pbuddy_mlmeext->cur_bwmode = HT_CHANNEL_WIDTH_20;
								pbuddy_mlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;
								break;								

